<a href="https://colab.research.google.com/github/giordanap/Udemy-Machine_Learning/blob/main/sript_02.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# librerías
import pandas as pd

# importar archivo de google drive
from google.colab import drive
import os
drive.mount('/content/drive/')
# os.getcwd()
os.chdir('/content/drive/My Drive/Academico/Udemy/GitHub/datasets/')

Mounted at /content/drive/

In [2]:
# Lectura de datos
data = pd.read_csv('titanic/titanic3.csv')

In [5]:
data.head(2)

   pclass  survived  ... body                        home.dest
0       1         1  ...  NaN                     St Louis, MO
1       1         1  ...  NaN  Montreal, PQ / Chesterville, ON

[2 rows x 14 columns]

In [6]:
data.shape

(1309, 14)

In [7]:
data.columns.values

array(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch',
       'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype=object)

In [8]:
data.describe()

            pclass     survived  ...         fare        body
count  1309.000000  1309.000000  ...  1308.000000  121.000000
mean      2.294882     0.381971  ...    33.295479  160.809917
std       0.837836     0.486055  ...    51.758668   97.696922
min       1.000000     0.000000  ...     0.000000    1.000000
25%       2.000000     0.000000  ...     7.895800   72.000000
50%       3.000000     0.000000  ...    14.454200  155.000000
75%       3.000000     1.000000  ...    31.275000  256.000000
max       3.000000     1.000000  ...   512.329200  328.000000

[8 rows x 7 columns]

In [9]:
data.dtypes

pclass         int64
survived       int64
name          object
sex           object
age          float64
sibsp          int64
parch          int64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

### Missing

In [10]:
pd.isnull(data['body']) ## pd.notnull(data['body']) ## será lo opuesto

0        True
1        True
2        True
3       False
4        True
        ...
1304    False
1305     True
1306    False
1307     True
1308     True
Name: body, Length: 1309, dtype: bool